# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 4 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone with FDConv and A2C2f_MoCA
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]       # 0-P1/2 (保持标准卷积)
  - [-1, 1, FDConv,  [128, 3, 2]]    # 1-P2/4 (FDConv)
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, FDConv,  [256, 3, 2]]    # 3-P3/8 (FDConv)
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, FDConv,  [512, 3, 2]]    # 5-P4/16 (FDConv)
  - [-1, 4, A2C2f_MoCA, [512, True, 4]]  # MoCA模块
  - [-1, 1, FDConv,  [1024, 3, 2]]   # 7-P5/32 (FDConv)
  - [-1, 4, A2C2f_MoCA, [1024, True, 1]] # MoCA模块

# Head with A2C2f_MoCA and Detect_PPA
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, A2C2f_MoCA, [512, False, -1]]  # MoCA模块

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, A2C2f_MoCA, [256, False, -1]]  # MoCA模块

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 2, A2C2f_MoCA, [512, False, -1]]  # MoCA模块

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]]

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect_PPA模块